In [1]:
import numpy as np
import pandas as pd

In [2]:
#데이터프레임을 구성할때
#1. 컬럼명 주고 만드는법
#2. 딕셔너리 집어넣는법
#3. 컴비네이션(딕셔너리 + 리스트)
data_list = [
    {'yyyy-mm-dd' : '1996-06-27', 'city' : 'incheon' },
    {'yyyy-mm-dd' : '2000-10-10', 'city' : 'incheon' },
    {'yyyy-mm-dd' : '1992-02-10', 'city' : 'incheon' }
]

In [3]:
df = pd.DataFrame(data_list, columns=['yyyy-mm-dd', 'city'])

In [4]:
df

   yyyy-mm-dd     city
0  1996-06-27  incheon
1  2000-10-10  incheon
2  1992-02-10  incheon

In [5]:
#년도만 빼내기
test = '1996-06-27'

In [8]:
#인덱스 접근
test[0:4]

'1996'

In [9]:
#split로 접근
test.split('-')[0]

'1996'

In [10]:
def extract_year(row):
    return row.split('-')[0]

In [13]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
#컬럼명의 데이터프레임 뒤에 apply쓰고 이미 만든 함수 apply하면 한줄씩 적용

In [14]:
df

   yyyy-mm-dd     city  year
0  1996-06-27  incheon  1996
1  2000-10-10  incheon  2000
2  1992-02-10  incheon  1992

In [18]:
def cal_age(row, this_year):
    return this_year - int(row)

In [19]:
cal_age(df['year'][0], 2020)

24

In [39]:
df['Age'] = df['year'].apply(cal_age, this_year=2020)

In [40]:
df

   yyyy-mm-dd     city  year  Age
0  1996-06-27  incheon  1996   24
1  2000-10-10  incheon  2000   20
2  1992-02-10  incheon  1992   28

In [49]:
def make_intro(row):
    return 'I was born in' + str(row.year) + ' at ' + row.city + '. My age is ' + str(row.Age)

In [50]:
#print('I was born in {0} at {2}. My age is {1}'.format(str(row_year), row.city, row.Age))

In [51]:
df['Introduction'] = df.apply(make_intro, axis=1)

In [52]:
df

   yyyy-mm-dd     city  year  Age                                Introduction
0  1996-06-27  incheon  1996   24  I was born in1996 at incheon. My age is 24
1  2000-10-10  incheon  2000   20  I was born in2000 at incheon. My age is 20
2  1992-02-10  incheon  1992   28  I was born in1992 at incheon. My age is 28

In [53]:
#문자열 포매팅 방법
def make_intro(row):
    return f'I was born in {row.year} at {row.city}. My age is {row.Age}.'